import '../style/index.scss'
import Keyboard from './keyboard'

new Keyboard().render()

console.log(
  '~50-70 балла(ов)\n' +
    'Отзыв по пунктам ТЗ:\n' +
    'Не выполненные/не засчитанные пункты:\n' +
    'Реализовано переключение виртуальной клавиатуры между английским и другим языком. Выбранный язык сохраняется после перезагрузки страницы. На странице указана комбинация клавиш для смены языка\n' +
    '\n' +
    'Частично выполненные пункты:\n' +
    'Нажатие клавиши на физической клавиатуре выделяют соответствующие клавиши на виртуальной.\n' +
    'Проверяются нажатия букв, цифр, знаков препинания, backspace, del (если есть), enter, shift, alt, ctrl, caps lock, space, стрелки — 5 балл(а)\n' +
    '\n' +
    '\n' +
    'Все оставшиеся пункты выполнены и не имеют комментариев' +
    ' проверяющего.\n' +
    'В ообщем и целом нет смены языка, не корректно работает шифт, альт' +
    ' && ктрл - не работают вовсе. КНОПКА DEL НЕ ОБЯЗАТЕЛЬНА, И У МЕНЯ' +
    ' ЕЁ НЕТ, любые вопросы пишите в лс!' +
    '\n' +
    'Жду отдельную' +
    ' брагодарочку за фон на канвасе, и за то что пожалел проверяющего,' +
    ' за загружая им Ваш кудахтер :3' +
    '\n' +
    'Так же ув. проверящий, не' +
    ' поленись перепроверить в последний день дедлайна кроссчека, и быть может' +
    'ты удивишся увидев что-то или работающее ))) '
)
